T24 integration - TCC - 2PC - SAGA
